Repository: kelvintaywl/ramenipsum
Catalog: locale/*/default.po
Languages: ja, th

source: soy sauce
ja: 醤油
th: ซีอิ๊ว

source: salt
ja: 塩
th: เกลือ

source: miso
ja: 味噌
th: มิโสะ

source: butter
ja: バター
th: เนย

source: roasted pork slices
ja: チャーシュー
th: หมูแดง

source: flavoured oil
ja: ラー油
th: น้ำมันพริก

source: yuzu
ja: ゆず
th: ยูซุ

source: seasoned egg
ja: 味付け卵
th: ไข่ปรุงรสพิเศษ

source: nori
ja: のり
th: โนริ

source: pork bones
ja: とんこつ
th: กระดูกหมู

source: bean sprouts
ja: もやし
th: ต้นกล้า

source: chopped onions
ja: 刻み玉ねぎ
th: หอมสับ

source: chilli
ja: 唐辛子
th: น้ำพริก

source: chicken stock
ja: 鶏がらスープ
th: น้ำสต๊อกไก่

source: kamaboko
ja: かまぼこ
th: คะมะโบะโกะ

source: spicy bean paste
ja: 豆板醤
th: เต้าเจี้ยวเผ็ด

source: bamboo slices
ja: メンマ
th: หน่อไม้

source: sesame oil
ja: 胡麻油
th: น้ำมันงา

source: minced garlic
ja: ニンニク
th: กระเทียมสับ

source: corn
ja: コーン
th: ข้าวโพด

source: pork cubes
ja: 豚バラ
th: หมู

source: scallions
ja: 新玉ねぎ
th: ต้นหอมจีน

source: spinach
ja: ほうれん草
th: ผักขม

source: leek
ja: 西洋葱
th: กระเทียมหอม

source: curry
ja: カレー
th: เครื่องแกง

source: vinegar
ja: 酢
th: น้ำส้มสายชู

source: ginger
ja: 生姜
th: ขิง

source: lard
ja: ラード
th: น้ำมันหมู

source: fish broth
ja: カツオだし
th: น้ำปลา

source: rice
ja: 御飯
th: ข้าว

source: ground black pepper
ja: 胡椒
th: พริกไทยดำ

source: soy milk
ja: 豆乳
th: นมถั่วเหลือง

source: wood ear mushroom
ja: 木耳
th: เห็ด

source: toasted sesame seeds
ja: ごま
th: เมล็ดงา

source: mustard greens
ja: 小松菜
th: ผักกาด

source: Asahikawa
ja: 旭川
th: อะซะฮิงะวะ

source: Hakodate
ja: 函館
th: ฮาโกดาเตะ

source: Sapporo
ja: 札幌
th: ซัปโปโร

source: Yokohama
ja: 横浜
th: โยโกฮามา

source: Hakata
ja: 博多
th: ฮากาตะ

source: Tokyo
ja: 東京
th: โตเกียว

source: Tokushima
ja: 徳島
th: โทะกุชิมะ

source: Kagoshima
ja: 鹿児島
th: ฮากาตะ

source: Wakayama
ja: 和歌山
th: วาคายามะ

source: Nagoya
ja: 名古屋
th: นาโกย่า

source: Kumamoto
ja: 熊本
th: คุมาโมโตะ

source: ramen burger
ja: ラーメンバーガー
th: เบอร์เกอร์ราเม็ง

source: tsukemen
ja: つけ麺
th: ก๋วยเตี๋ยวน้ำตกญี่ปุ่น

source: abura soba
ja: 油そば
th: โซบะน้ำมัน

source: Nissin instant cup ramen
ja: カップラーメン
th: บะหมี่ถ้วย
